x = float(input("Введіть координату x точки A: "))
y = float(input("Введіть координату y точки A: "))

if x == 0 and y == 0:
  print("Точка A лежить в початку координат.")
elif x == 0:
  print("Точка A лежить на осі OY.")
elif y == 0:
  print("Точка A лежить на осі OX.")
elif x > 0 and y > 0:
  print("Точка A лежить в першому координатному куті.")
elif x < 0 and y > 0:
  print("Точка A лежить в другому координатному куті.")
elif x < 0 and y < 0:
  print("Точка A лежить в третьому координатному куті.")
else:
  print("Точка A лежить в четвертому координатному куті.")